import { motion } from "framer-motion";

export const Logo = ({ className }: { className?: string }) => {
  return (
    <motion.svg
      viewBox="0 0 100 100"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      className={className}
    >
      {/* Группа H (Левая часть) */}
      <motion.g
        variants={{
          hover: { x: -2, transition: { duration: 0.3, ease: "easeOut" } }
        }}
      >
        {/* Верхняя ножка H */}
        <path d="M38.7013 21.0173V45.9569H33.5945V21.0173H38.7013Z" fill="currentColor"/>
        {/* Нижняя ножка H */}
        <path d="M38.669 54.2397V76.9952H33.5667V54.2397H38.669Z" fill="currentColor"/>
        {/* Перекладина (Меч) */}
        <path d="M29.1034 47.4662H60.3759C60.2676 47.5982 60.2122 47.6789 60.1441 47.7469L55.4227 52.4681C55.2337 52.6583 55.0436 52.7359 54.7749 52.7358H29.1034V47.4662Z" fill="currentColor"/>
      </motion.g>

      {/* Группа P (Правая часть) */}
      <motion.g
        variants={{
          hover: { x: 4, transition: { duration: 0.3, ease: "easeOut" } }
        }}
      >
        {/* Основная часть P / Стрелка */}
        <path 
          d="M67.6089 24.5408C67.6089 31.9072 67.6089 39.2356 67.6089 46.5641C67.6089 46.7772 67.5951 46.9567 67.4168 47.1227C65.8643 48.5683 64.3219 50.0248 62.7761 51.4778C62.7303 51.5208 62.6802 51.5593 62.5658 51.656C62.5551 47.1367 62.5648 42.6828 62.5628 38.2291V24.8013H42.1815C42.2718 24.6785 42.3122 24.6071 42.3677 24.5504L46.9271 19.8886C47.1007 19.7103 47.2738 19.6216 47.5354 19.622C53.9527 19.6307 60.3701 19.6295 67.6089 19.6302V24.5408Z" 
          fill="currentColor"
        />
      </motion.g>
    </motion.svg>
  );
};